## DataFrame

### 1.1 dataframe的创建

In [1]:
import numpy as np
import pandas as pd

In [2]:
# 用字典创建dataframe
data = {'city': ['北京', '北京', '北京', '上海', '上海', '上海'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'population': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

  city  year  population
0   北京  2000         1.5
1   北京  2001         1.7
2   北京  2002         3.6
3   上海  2001         2.4
4   上海  2002         2.9
5   上海  2003         3.2

In [3]:
type(frame)

pandas.core.frame.DataFrame

In [6]:
type(frame['year'])

pandas.core.series.Series

In [7]:
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [8]:
frame[['year']]

   year
0  2000
1  2001
2  2002
3  2001
4  2002
5  2003

In [9]:
 pd.DataFrame(data, columns=['year', 'city', 'population'])

   year city  population
0  2000   北京         1.5
1  2001   北京         1.7
2  2002   北京         3.6
3  2001   上海         2.4
4  2002   上海         2.9
5  2003   上海         3.2

In [10]:
frame2 = pd.DataFrame(data,columns=['year','city', 'population', 'debt'])
frame2

   year city  population debt
0  2000   北京         1.5  NaN
1  2001   北京         1.7  NaN
2  2002   北京         3.6  NaN
3  2001   上海         2.4  NaN
4  2002   上海         2.9  NaN
5  2003   上海         3.2  NaN

In [7]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
frame2.values

array([[2000, '北京', 1.5, nan],
       [2001, '北京', 1.7, nan],
       [2002, '北京', 3.6, nan],
       [2001, '上海', 2.4, nan],
       [2002, '上海', 2.9, nan],
       [2003, '上海', 3.2, nan]], dtype=object)

In [11]:
frame2_1 =  pd.DataFrame(data,columns=['year','city', 'population', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2_1

       year city  population debt
one    2000   北京         1.5  NaN
two    2001   北京         1.7  NaN
three  2002   北京         3.6  NaN
four   2001   上海         2.4  NaN
five   2002   上海         2.9  NaN
six    2003   上海         3.2  NaN

In [12]:
# 列索引多指定不会报错，行索引多指定会报错
frame2=  pd.DataFrame(data,columns=['year','city', 'population', 'debt'],
                      index=['a', 'b', 'c', 'd', 'e', 'f'])
frame2

   year city  population debt
a  2000   北京         1.5  NaN
b  2001   北京         1.7  NaN
c  2002   北京         3.6  NaN
d  2001   上海         2.4  NaN
e  2002   上海         2.9  NaN
f  2003   上海         3.2  NaN

In [12]:
# 利用嵌套字典创建dataframe
pop = {'北京': {2001: 2.4, 2002: 2.9},
       '南京': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

       北京   南京
2000  NaN  1.5
2001  2.4  1.7
2002  2.9  3.6

### 1.2 列数据的获取

In [13]:
frame2

   year city  population debt
a  2000   北京         1.5  NaN
b  2001   北京         1.7  NaN
c  2002   北京         3.6  NaN
d  2001   上海         2.4  NaN
e  2002   上海         2.9  NaN
f  2003   上海         3.2  NaN

In [14]:
frame2['city']

0    北京
1    北京
2    北京
3    上海
4    上海
5    上海
Name: city, dtype: object

In [15]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [16]:
frame2[['year','population']]

   year  population
a  2000         1.5
b  2001         1.7
c  2002         3.6
d  2001         2.4
e  2002         2.9
f  2003         3.2

In [23]:
frame2.loc[['a','b'],['year']]

   year
a  2000
b  2001

In [21]:
# frame2.loc(param1.param2)
frame2.loc[['a','b'],['year','population']]

   year  population
a  2000         1.5
b  2001         1.7

In [ ]:
frame2.loc[[0:2],['year','population']]

In [ ]:
print(type(frame2['city']))

In [ ]:
print(type(frame2[['city']]))

In [ ]:
frame2[['city']]

In [ ]:
frame2[['population','city']]

In [ ]:
frame2.loc[:,['population']]

In [ ]:
frame2.loc[:,['population','city']]

In [22]:
frame2.iloc[0:2,[0,3]] #i代表integer location

   year debt
a  2000  NaN
b  2001  NaN

In [24]:
# 奇数行，偶数列
frame2.iloc[np.arange(frame2.shape[0])%2==1, np.arange(frame2.shape[1])%2==0]

   year  population
b  2001         1.7
d  2001         2.4
f  2003         3.2

### 1.3 行数据的获取

In [25]:
frame2_1

       year city  population debt
one    2000   北京         1.5  NaN
two    2001   北京         1.7  NaN
three  2002   北京         3.6  NaN
four   2001   上海         2.4  NaN
five   2002   上海         2.9  NaN
six    2003   上海         3.2  NaN

In [ ]:
frame2_1['one',:]

In [ ]:
frame2_1['one']

In [27]:
frame2_1.loc[['two','one']]

     year city  population debt
two  2001   北京         1.7  NaN
one  2000   北京         1.5  NaN

In [26]:
frame2_1.iloc[0:2]

     year city  population debt
one  2000   北京         1.5  NaN
two  2001   北京         1.7  NaN

In [ ]:
type(ser)

### 1.4 赋值

In [32]:
frame2['debt'] = np.arange(1,0.5*(frame2.shape[0])+1,0.5)
frame2

   year city  population  debt
a  2000   北京         1.5   1.0
b  2001   北京         1.7   1.5
c  2002   北京         3.6   2.0
d  2001   上海         2.4   2.5
e  2002   上海         2.9   3.0
f  2003   上海         3.2   3.5

In [24]:
# 删除列
del frame2['debt']
frame2

   year city  population
a  2000   北京         1.5
b  2001   北京         1.7
c  2002   北京         3.6
d  2001   上海         2.4
e  2002   上海         2.9
f  2003   上海         3.2

In [34]:
# 添加新列
frame2['location'] = ['北部','北部','北部','东部','东部','东部']
# del frame2['位置']
frame2

   year city  population  debt location
a  2000   北京         1.5   1.0       北部
b  2001   北京         1.7   1.5       北部
c  2002   北京         3.6   2.0       北部
d  2001   上海         2.4   2.5       东部
e  2002   上海         2.9   3.0       东部
f  2003   上海         3.2   3.5       东部

In [35]:
frame2['longitude'] = np.random.rand(frame2.shape[0])*180
frame2['latitude'] = np.random.rand(frame2.shape[0])*180
frame2

   year city  population  debt location   longitude    latitude
a  2000   北京         1.5   1.0       北部  126.645820   27.919605
b  2001   北京         1.7   1.5       北部   50.838200  165.597482
c  2002   北京         3.6   2.0       北部  158.997149   65.046083
d  2001   上海         2.4   2.5       东部   21.629750  162.363953
e  2002   上海         2.9   3.0       东部  160.632020   17.652367
f  2003   上海         3.2   3.5       东部  173.446360  116.484625

In [39]:
frame2.drop(['year','city'],axis=1,inplace=True)

In [41]:
frame3 = frame2.drop(['debt'],axis=1)
frame3

   population location   longitude    latitude
a         1.5       北部  126.645820   27.919605
b         1.7       北部   50.838200  165.597482
c         3.6       北部  158.997149   65.046083
d         2.4       东部   21.629750  162.363953
e         2.9       东部  160.632020   17.652367
f         3.2       东部  173.446360  116.484625

In [42]:
frame2

   population  debt location   longitude    latitude
a         1.5   1.0       北部  126.645820   27.919605
b         1.7   1.5       北部   50.838200  165.597482
c         3.6   2.0       北部  158.997149   65.046083
d         2.4   2.5       东部   21.629750  162.363953
e         2.9   3.0       东部  160.632020   17.652367
f         3.2   3.5       东部  173.446360  116.484625

In [31]:
frame2.drop('a', axis=0)

   year city  population location
b  2001   北京         1.7       北部
c  2002   北京         3.6       北部
d  2001   上海         2.4       东部
e  2002   上海         2.9       东部
f  2003   上海         3.2       东部

In [33]:
frame2.drop(['c','d'], axis=0,inplace=True)

In [34]:
frame2

   year city  population location
a  2000   北京         1.5       北部
b  2001   北京         1.7       北部
e  2002   上海         2.9       东部
f  2003   上海         3.2       东部

### apply

In [35]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['BJ', 'SH', 'GZ', 'SZ'])
frame

           b         d         e
BJ  0.233763 -0.447509  0.444315
SH  0.656222 -0.398871  0.166988
GZ -0.399085 -0.970870  0.746310
SZ -1.257227  0.088396  1.895817

In [36]:
def function(x):
    return x+1

In [37]:
frame['b'].apply(function)

BJ    1.233763
SH    1.656222
GZ    0.600915
SZ   -0.257227
Name: b, dtype: float64

In [38]:
frame['b'].apply(lambda x:x+1)

BJ    1.233763
SH    1.656222
GZ    0.600915
SZ   -0.257227
Name: b, dtype: float64

In [39]:
# index排序
frame = pd.DataFrame(np.arange(8).reshape(2, 4),index=['four', 'one'],columns=['d', 'a', 'b', 'c'])
frame

      d  a  b  c
four  0  1  2  3
one   4  5  6  7

In [40]:
# dataframe有两个索引，一个是行索引，一个是列索引
frame.sort_index()

      d  a  b  c
four  0  1  2  3
one   4  5  6  7

In [41]:
frame.sort_index(axis = 1,ascending=False)

      d  c  b  a
four  0  3  2  1
one   4  7  6  5

In [42]:
frame.sort_index(axis = 1)

      a  b  c  d
four  1  2  3  0
one   5  6  7  4

In [43]:
# value排序
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [44]:
frame.sort_values(by='b',ascending=False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [45]:
frame.sort_values(by=['a','b'],ascending=False)

   b  a
1  7  1
3  2  1
0  4  0
2 -3  0